CSI API ETABS v1
cStory.GetMasterStory Method
 Retrieves whether a defined story is a master story
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMasterStory(
	string Name,
	ref bool IsMasterStory
)
Function GetMasterStory (
	Name As String,
	ByRef IsMasterStory As Boolean
) As Integer
Dim instance As cStory
Dim Name As String
Dim IsMasterStory As Boolean
Dim returnValue As Integer
returnValue = instance.GetMasterStory(Name,
	IsMasterStory)
int GetMasterStory(
	String^ Name,
	bool% IsMasterStory
)
abstract GetMasterStory :
        Name : string *
        IsMasterStory : bool byref -> int
Parameters
Name
Type: System.String
 The name of a defined story
IsMasterStory
Type: System.Boolean
True if the story is a master story, False otherwise
Return Value
Type: Int32
 Returns zero if the value is successfully retrieved, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MasterStory As Boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get story master story
       ret = SapModel.Story.GetMasterStory("Story4", MasterStory)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace